{
    "posts": [
      {
        "id": 1,
        "title": "My First Blog Post",
        "date": "2024-11-18",
        "tags": ["Announcement","Artwork","Project","Update"],
        "excerpt": "My thoughts on this website, and what's next.",
        "image": "images/frogBeeIcon.png",
        "content": [
        "So this is my first blog post. Though, it's kind of weird, knowing that i'm writing all of this on a personal platform that I made myself.",
        "Its been awhile since I started this journey of learning digital art, coding, and a whole lot of other things. It's still a little shocking to compare myself to only a year ago, where I had only just graduated from high school, and walked out with a diploma and a single pipe dream.",
        "Now, I'm here, with a website that I made myself, a handful of projects in-progress, and a growing portfolio of artwork that I can be proud of. I've learned a lot now, and there's still a lot more to go. If I had to describe it, it feels like a magic portal of some sort has opened up, and while I can't step through just yet, the view on the other side is really motivating.",
        "I plan to use this blog to document my plans, and to share some of my thoughts on the projects I'm working on. I hope that you'll stick around to see what's next, and maybe even join me on this adventure.",
        "On the side here are some of the early and current versions of the mascots I concepted for my online persona. Captain Narwhal didn't make the cut, but maybe he'll show up somewhere else in the future?",
        "Maybe, maybe not. Who knows?"
      ],
        "media": [
            "images/blogImages/11-18-24/frogBeeConcept.PNG",
            "images/blogImages/11-18-24/frogBeeIcon.PNG",
            "images/blogImages/11-18-24/capNarwhal.PNG",
            "images/blogImages/11-18-24/capNarwhal2.PNG",
            "images/blogImages/11-18-24/capNarwhal3.PNG"
        ]
      },
      {
        "id": 2,
        "title": "Another Blog Post",
        "date": "2024-11-19",
        "tags":["Artwork"],
        "excerpt": "Just a test post.",
        "image": "images/frogBeeIcon.png",
        "content":[
        "This post doesn't have anything of substance to say. It's really only here to display the functionality of this website.",
        "Maybe try taking a look around somewhere else?"],
        "media": [
            "images/splashing3.JPG",
            "images/splashing4.JPG",
            "images/splashing5.JPG",
            "images/splashing6.JPG"
        ]
      }
    ]
  }
  